Конфигурация/Catalogs/Закладные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Закладные</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокКредитногоДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКредита</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПоКредиту</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйАктивЦБРФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУчетныхАктивовЦБРФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Имущество</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Закладные/Ext/ManagerModule.bsl
Функция СформироватьНаименование(РеквизитыДоговора, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "Банк, НомерКредитногоДоговора, ДатаКредитногоДоговора";
	
	Если РеквизитыДоговора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаименованиеДоговора = "";
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.Банк) И Не ПустаяСтрока(РеквизитыДоговора.НомерКредитногоДоговора) И ЗначениеЗаполнено(РеквизитыДоговора.ДатаКредитногоДоговора) Тогда
		НаименованиеДоговора = "" + РеквизитыДоговора.Банк + ", № " + СокрЛП(РеквизитыДоговора.НомерКредитногоДоговора) + " от " + Формат(РеквизитыДоговора.ДатаКредитногоДоговора, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат НаименованиеДоговора;
	
КонецФункции // СформироватьНаименованиеДоговора
